export const projects = [
    {
        id: 1,
        imgUrl: "/src/assets/frames/pixelmem/анимка 1 секунда.html",
        name: "номер один ❝Паладин❞",
        description: "Разработка анимации начачась именно с этой работы. " +
            "Спустя протяжительное время я нашел понравившегося мне персонажа, разбитого на покадровую анимацию, " +
            "и спустя небольшое количество времени на освоение новой программы, " +
            "я создал свою первую анимацию, с помощью покадровой методики, " +
            "проделанную с использованием Adobe Animate. По началу все прошло отлично и работа с софтом не вызывала " +
            "никаких трудностей, но тогда я еще не знал, что меня ждет дальше."
    },
    {
        id: 2,
        imgUrl: "/src/assets/frames/undertale/Undertale.html",
        name: "номер два ❝Undertale❞",
        description: "В этой работе я вырезал окружение, персонажей и другие элементы добавив им анимацию движения и " +
            "таким образом воссоздал начало игры Undertale. " +
            "Для этого я использовал пресеты движений и изменял заданые траектории движения. " +
            "Это позволило мне создать движение элементов, которое добавило динамичности моей работе. " +
            "Намного удобнее было бы если я тогда знал о существовании анимации с помощью символом. "
    },
    {
        id: 3,
        imgUrl: "/src/assets/frames/samurai/Безымянный-1.html",
        name: "номер три ❝Самураи❞",
        description: "Для этой работы я подготовил персонажа и разрезал его на кусочки. Затем создал зацикленную " +
            "анимация с помощью этих кусочков используя аниацию символов, чтобы создать эффект, будто самураи выходят " +
            "из тени и смотрят друг на друга. Я также добавил движение рук, чтобы сделать сцену более живой и интересной."
    },
    {
        id: 4,
        imgUrl: "/src/assets/frames/snake/животные.html",
        name: "номер четыре ❝Животные❞",
        description: "В этой работе я хотел создать стилизованных животных, состоящих из простых фигур." +
            "Для этого я потратил много времени на поиск референсов и обдумывание концепции." +
            "Рисование в Adobe Animate вызвало у меня трудности, но итоговая работа получилась привлекательной и милой. " +
            "Я доволен результатом. Однако при публикации анимации я столкнулся с проблемами искажения некоторых " +
            "анимаций и эффектов при размещении на сайте. Не знаю с чем это связано."
    },
    {
        id: 5,
        imgUrl: "/src/assets/frames/book/book.html",
        name: "номер пять ❝Дюна❞",
        description: "В этой работе я создал минималистичную обложку для книги Фрэнка Герберта «Дюна». " +
            "Для анимации я использовал новый метод — анимацию формы с помощью которой анимировал цифры, буквы и объекты. " +
            "Результат получился немного кринжовым, но всё же анимация имеет свой сюжет."
    },
    {
        id: 6,
        imgUrl: "/src/assets/frames/park/парк.html",
        name: "номер шесть ❝Парк❞",
        description: "Это моя самая нелюбимая работа, над ней я не смог поработать усердно из за недостатка идей. " +
            "Мне не очень понравилась работа с костями. Мой фаворит в принципах анимации — покадровая анимация. " +
            "В этой анимации распиленная девочка с помощью инструмента костей научилась ходить, а нарисованная птичка — летать."
    },
    {
        id: 7,
        imgUrl: "/src/assets/frames/text/text.html",
        name: "номер семь ❝Ералаш❞",
        description: "Несложно догадаться, что эта работа вдохновлена вставками из известого российский юмористический " +
            "киножурнал 'Ералаш'. Как только я увидел задание к этой работе у меня сразу возникла идея перенести всем " +
            "известные вставки в HTLM анимацию. Особо трудностей это не вызвало, что не скажешь про предыдущие работы."
    },
    {
        id: 8,
        imgUrl: "/src/assets/frames/fat/жир.html",
        name: "номер восемь ❝Fat boy❞",
        description: "Одна из моих самых любимых работ. Здесь меня не ограничивали определёнными методами анимации, " +
            "и я смог использовать самый любимый, для меня, метод — покадровую анимацию (в несколько кадров, когда одно изображение " +
            "удерживается в течение нескольких кадров). Также для улучшения восприятия я использовал звуковое сопровождение. " +
            "Над своей финальной работой я собираюсь проделать большую работу используя самые привлекательные методы анимации."
    }
]